Wallet/src/DataProcessors/ЗагрузкаКурсовВалют/ЗагрузкаКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалют</name>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагружаемыеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.СуммаДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>Записан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Wallet/src/DataProcessors/ЗагрузкаКурсовВалют/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	НЕ Валюты.ПометкаУдаления
	|	И Валюты.ЗагружаетсяИзИнтернета";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.ЗагружаемыеВалюты.Загрузить(РезультатЗапроса);
	Объект.ДатаЗагрузки = ТекущаяДатаСеанса();

	Элементы.ЗагружаемыеВалютыКурс.Видимость = Ложь;
	Элементы.ЗагружаемыеВалютыЗаписан.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)

	СообщениеПользователю = Новый СообщениеПользователю;

	Если Не ЗначениеЗаполнено(Объект.ДатаЗагрузки) Тогда
		СообщениеПользователю.Текст = НСтр("ru = 'Не задана дата загрузки.'");
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;

	Если Объект.ЗагружаемыеВалюты.Количество() = 0 Тогда
		СообщениеПользователю.Текст = НСтр("ru = 'Не выбрано ни одной валюты для загрузки.'");
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
    
    // Загружаем курсы
	ЗагрузитьНаСервере();

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()

	ОсновнаяВалюта = Константы.ОсновнаяВалюта.Получить();
	Если ОсновнаяВалюта.Пустая() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не задана основная валюта учета";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
    
    // Очищаем табличную часть перед загрузкой
	ТабЗнач = Объект.ЗагружаемыеВалюты.Выгрузить();
	ТабЗнач.Свернуть("Валюта");
	Объект.ЗагружаемыеВалюты.Загрузить(ТабЗнач);    
    
    //Создаем прокси для обращения к внешнему веб-сервису,
    // передаем в функцию URI пространства имен, имя сервиса, имя порта.
	Прокси = WSСсылки.ЦБ_РФ.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
    
    //Получаем тип параметра, который передается в метод GetCursOnDate.
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");
    
    //Создаем параметр на основе типа и заполняем значение параметра On_Date.
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date = Объект.ДатаЗагрузки;
    
    //Вызываем метод веб-сервиса, записываем результат в переменную КурсыВалют.
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	ТаблицаДанных = КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate;

	Для Каждого Элемент Из ТаблицаДанных Цикл
		ЗагружаемаяВалюта = Справочники.Валюты.НайтиПоКоду(Элемент.Vcode);
		Если ЗагружаемаяВалюта.Пустая() Тогда
			Продолжить;
		КонецЕсли;

		НайденныеСтроки = Объект.ЗагружаемыеВалюты.НайтиСтроки(Новый Структура("Валюта", ЗагружаемаяВалюта));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Курс = Элемент.Vcurs;
			НайденныеСтроки[0].Записан = Ложь;
		КонецЕсли;
	КонецЦикла;

	НайденныеСтроки = Объект.ЗагружаемыеВалюты.НайтиСтроки(Новый Структура("Валюта", ОсновнаяВалюта));
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].Курс = 1;
		НайденныеСтроки[0].Записан = Ложь;
	КонецЕсли;

	Элементы.ЗагружаемыеВалютыКурс.Видимость = Истина;
	Элементы.ЗагружаемыеВалютыЗаписан.Видимость = Истина;
	Элементы.ЗагружаемыеВалютыКурс.ТолькоПросмотр = Истина;
	Элементы.ЗагружаемыеВалютыЗаписан.ТолькоПросмотр = Истина;

КонецПроцедуры

#КонецОбласти
